Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xe92 (32-bit)
   Version:       2
   Abbrev Offset: 0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    < c>   DW_AT_producer    : GNU C 4.6.4 build on 2016-03-01	
    <2c>   DW_AT_language    : 1	(ANSI C)
    <2d>   DW_AT_name        : ../src/hello.c	
    <3c>   DW_AT_comp_dir    : C:\Users\sunguopeng\workspace\Test\iROM	
    <64>   DW_AT_low_pc      : 0x800002cc	
    <68>   DW_AT_high_pc     : 0x80000408	
    <6c>   DW_AT_stmt_list   : 0x0	
    <70>   DW_AT_macro_info  : 0x0	
 <1><74>: Abbrev Number: 2 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 4	
    <76>   DW_AT_encoding    : 5	(signed)
    <77>   DW_AT_name        : long int	
 <1><80>: Abbrev Number: 2 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4	
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : long unsigned int	
 <1><95>: Abbrev Number: 2 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 8	
    <97>   DW_AT_encoding    : 5	(signed)
    <98>   DW_AT_name        : long long int	
 <1><a6>: Abbrev Number: 2 (DW_TAG_base_type)
    <a7>   DW_AT_byte_size   : 8	
    <a8>   DW_AT_encoding    : 7	(unsigned)
    <a9>   DW_AT_name        : long long unsigned int	
 <1><c0>: Abbrev Number: 2 (DW_TAG_base_type)
    <c1>   DW_AT_byte_size   : 4	
    <c2>   DW_AT_encoding    : 5	(signed)
    <c3>   DW_AT_name        : int	
 <1><c7>: Abbrev Number: 2 (DW_TAG_base_type)
    <c8>   DW_AT_byte_size   : 4	
    <c9>   DW_AT_encoding    : 7	(unsigned)
    <ca>   DW_AT_name        : unsigned int	
 <1><d7>: Abbrev Number: 2 (DW_TAG_base_type)
    <d8>   DW_AT_byte_size   : 1	
    <d9>   DW_AT_encoding    : 6	(signed char)
    <da>   DW_AT_name        : char	
 <1><df>: Abbrev Number: 3 (DW_TAG_typedef)
    <e0>   DW_AT_name        : uint8	
    <e6>   DW_AT_decl_file   : 1	
    <e7>   DW_AT_decl_line   : 9	
    <e8>   DW_AT_type        : <0xec>	
 <1><ec>: Abbrev Number: 2 (DW_TAG_base_type)
    <ed>   DW_AT_byte_size   : 1	
    <ee>   DW_AT_encoding    : 8	(unsigned char)
    <ef>   DW_AT_name        : unsigned char	
 <1><fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <fe>   DW_AT_name        : sint8	
    <104>   DW_AT_decl_file   : 1	
    <105>   DW_AT_decl_line   : 10	
    <106>   DW_AT_type        : <0x10a>	
 <1><10a>: Abbrev Number: 2 (DW_TAG_base_type)
    <10b>   DW_AT_byte_size   : 1	
    <10c>   DW_AT_encoding    : 6	(signed char)
    <10d>   DW_AT_name        : signed char	
 <1><119>: Abbrev Number: 3 (DW_TAG_typedef)
    <11a>   DW_AT_name        : uint16	
    <121>   DW_AT_decl_file   : 1	
    <122>   DW_AT_decl_line   : 11	
    <123>   DW_AT_type        : <0x127>	
 <1><127>: Abbrev Number: 2 (DW_TAG_base_type)
    <128>   DW_AT_byte_size   : 2	
    <129>   DW_AT_encoding    : 7	(unsigned)
    <12a>   DW_AT_name        : short unsigned int	
 <1><13d>: Abbrev Number: 3 (DW_TAG_typedef)
    <13e>   DW_AT_name        : uint32	
    <145>   DW_AT_decl_file   : 1	
    <146>   DW_AT_decl_line   : 12	
    <147>   DW_AT_type        : <0xc7>	
 <1><14b>: Abbrev Number: 3 (DW_TAG_typedef)
    <14c>   DW_AT_name        : uinit8_1	
    <155>   DW_AT_decl_file   : 1	
    <156>   DW_AT_decl_line   : 14	
    <157>   DW_AT_type        : <0xdf>	
 <1><15b>: Abbrev Number: 3 (DW_TAG_typedef)
    <15c>   DW_AT_name        : uint8_2	
    <164>   DW_AT_decl_file   : 1	
    <165>   DW_AT_decl_line   : 15	
    <166>   DW_AT_type        : <0x14b>	
 <1><16a>: Abbrev Number: 4 (DW_TAG_enumeration_type)
    <16b>   DW_AT_byte_size   : 1	
    <16c>   DW_AT_decl_file   : 1	
    <16d>   DW_AT_decl_line   : 18	
    <16e>   DW_AT_sibling     : <0x1d3>	
 <2><172>: Abbrev Number: 5 (DW_TAG_enumerator)
    <173>   DW_AT_name        : TestEnumType1	
    <181>   DW_AT_const_value : 0	
 <2><182>: Abbrev Number: 5 (DW_TAG_enumerator)
    <183>   DW_AT_name        : TestEnumType2	
    <191>   DW_AT_const_value : 1	
 <2><192>: Abbrev Number: 5 (DW_TAG_enumerator)
    <193>   DW_AT_name        : TestEnumType3	
    <1a1>   DW_AT_const_value : 2	
 <2><1a2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <1a3>   DW_AT_name        : TestEnumType4	
    <1b1>   DW_AT_const_value : 3	
 <2><1b2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <1b3>   DW_AT_name        : TestEnumType5	
    <1c1>   DW_AT_const_value : 4	
 <2><1c2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <1c3>   DW_AT_name        : TestEnumType6	
    <1d1>   DW_AT_const_value : 5	
 <1><1d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d4>   DW_AT_name        : TestEnumType	
    <1e1>   DW_AT_decl_file   : 1	
    <1e2>   DW_AT_decl_line   : 25	
    <1e3>   DW_AT_type        : <0x16a>	
 <1><1e7>: Abbrev Number: 6 (DW_TAG_enumeration_type)
    <1e8>   DW_AT_name        : TestEnumTypeA	
    <1f6>   DW_AT_byte_size   : 1	
    <1f7>   DW_AT_decl_file   : 1	
    <1f8>   DW_AT_decl_line   : 27	
    <1f9>   DW_AT_sibling     : <0x264>	
 <2><1fd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <1fe>   DW_AT_name        : TestEnumType11	
    <20d>   DW_AT_const_value : 0	
 <2><20e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <20f>   DW_AT_name        : TestEnumType21	
    <21e>   DW_AT_const_value : 1	
 <2><21f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <220>   DW_AT_name        : TestEnumType31	
    <22f>   DW_AT_const_value : 2	
 <2><230>: Abbrev Number: 5 (DW_TAG_enumerator)
    <231>   DW_AT_name        : TestEnumType41	
    <240>   DW_AT_const_value : 3	
 <2><241>: Abbrev Number: 5 (DW_TAG_enumerator)
    <242>   DW_AT_name        : TestEnumType51	
    <251>   DW_AT_const_value : 4	
 <2><252>: Abbrev Number: 5 (DW_TAG_enumerator)
    <253>   DW_AT_name        : TestEnumType61	
    <262>   DW_AT_const_value : 5	
 <1><264>: Abbrev Number: 3 (DW_TAG_typedef)
    <265>   DW_AT_name        : TestEnumAType	
    <273>   DW_AT_decl_file   : 1	
    <274>   DW_AT_decl_line   : 35	
    <275>   DW_AT_type        : <0x1e7>	
 <1><279>: Abbrev Number: 7 (DW_TAG_structure_type)
    <27a>   DW_AT_name        : TestStructFileds	
    <28b>   DW_AT_byte_size   : 4	
    <28c>   DW_AT_decl_file   : 1	
    <28d>   DW_AT_decl_line   : 39	
    <28e>   DW_AT_sibling     : <0x2e3>	
 <2><292>: Abbrev Number: 8 (DW_TAG_member)
    <293>   DW_AT_name        : filed1	
    <29a>   DW_AT_decl_file   : 1	
    <29b>   DW_AT_decl_line   : 41	
    <29c>   DW_AT_type        : <0x13d>	
    <2a0>   DW_AT_byte_size   : 4	
    <2a1>   DW_AT_bit_size    : 5	
    <2a2>   DW_AT_bit_offset  : 27	
    <2a3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><2a6>: Abbrev Number: 8 (DW_TAG_member)
    <2a7>   DW_AT_name        : filed2	
    <2ae>   DW_AT_decl_file   : 1	
    <2af>   DW_AT_decl_line   : 42	
    <2b0>   DW_AT_type        : <0x13d>	
    <2b4>   DW_AT_byte_size   : 4	
    <2b5>   DW_AT_bit_size    : 6	
    <2b6>   DW_AT_bit_offset  : 21	
    <2b7>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><2ba>: Abbrev Number: 8 (DW_TAG_member)
    <2bb>   DW_AT_name        : filed3	
    <2c2>   DW_AT_decl_file   : 1	
    <2c3>   DW_AT_decl_line   : 43	
    <2c4>   DW_AT_type        : <0x13d>	
    <2c8>   DW_AT_byte_size   : 4	
    <2c9>   DW_AT_bit_size    : 5	
    <2ca>   DW_AT_bit_offset  : 16	
    <2cb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><2ce>: Abbrev Number: 8 (DW_TAG_member)
    <2cf>   DW_AT_name        : filed4	
    <2d6>   DW_AT_decl_file   : 1	
    <2d7>   DW_AT_decl_line   : 44	
    <2d8>   DW_AT_type        : <0x13d>	
    <2dc>   DW_AT_byte_size   : 4	
    <2dd>   DW_AT_bit_size    : 8	
    <2de>   DW_AT_bit_offset  : 8	
    <2df>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <1><2e3>: Abbrev Number: 3 (DW_TAG_typedef)
    <2e4>   DW_AT_name        : TestStructFiledsType	
    <2f9>   DW_AT_decl_file   : 1	
    <2fa>   DW_AT_decl_line   : 46	
    <2fb>   DW_AT_type        : <0x279>	
 <1><2ff>: Abbrev Number: 7 (DW_TAG_structure_type)
    <300>   DW_AT_name        : TestStructArrayLevel5	
    <316>   DW_AT_byte_size   : 80	
    <317>   DW_AT_decl_file   : 1	
    <318>   DW_AT_decl_line   : 49	
    <319>   DW_AT_sibling     : <0x3ad>	
 <2><31d>: Abbrev Number: 9 (DW_TAG_member)
    <31e>   DW_AT_name        : (indirect string, offset: 0x12): level5_1	
    <322>   DW_AT_decl_file   : 1	
    <323>   DW_AT_decl_line   : 50	
    <324>   DW_AT_type        : <0x3ad>	
    <328>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><32b>: Abbrev Number: 9 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0x1b): level5_2	
    <330>   DW_AT_decl_file   : 1	
    <331>   DW_AT_decl_line   : 51	
    <332>   DW_AT_type        : <0x3ad>	
    <336>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><339>: Abbrev Number: 10 (DW_TAG_member)
    <33a>   DW_AT_name        : level5_3	
    <343>   DW_AT_decl_file   : 1	
    <344>   DW_AT_decl_line   : 52	
    <345>   DW_AT_type        : <0x3bd>	
    <349>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><34c>: Abbrev Number: 9 (DW_TAG_member)
    <34d>   DW_AT_name        : (indirect string, offset: 0x24): level5_4	
    <351>   DW_AT_decl_file   : 1	
    <352>   DW_AT_decl_line   : 53	
    <353>   DW_AT_type        : <0x3bd>	
    <357>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><35a>: Abbrev Number: 10 (DW_TAG_member)
    <35b>   DW_AT_name        : level5_777	
    <366>   DW_AT_decl_file   : 1	
    <367>   DW_AT_decl_line   : 54	
    <368>   DW_AT_type        : <0x15b>	
    <36c>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><36f>: Abbrev Number: 10 (DW_TAG_member)
    <370>   DW_AT_name        : Filed1	
    <377>   DW_AT_decl_file   : 1	
    <378>   DW_AT_decl_line   : 55	
    <379>   DW_AT_type        : <0x2e3>	
    <37d>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><380>: Abbrev Number: 10 (DW_TAG_member)
    <381>   DW_AT_name        : FiledEnum	
    <38b>   DW_AT_decl_file   : 1	
    <38c>   DW_AT_decl_line   : 56	
    <38d>   DW_AT_type        : <0x1d3>	
    <391>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><394>: Abbrev Number: 10 (DW_TAG_member)
    <395>   DW_AT_name        : FiledEnumAray	
    <3a3>   DW_AT_decl_file   : 1	
    <3a4>   DW_AT_decl_line   : 57	
    <3a5>   DW_AT_type        : <0x3cd>	
    <3a9>   DW_AT_data_member_location: 2 byte block: 23 49 	(DW_OP_plus_uconst: 73)
 <1><3ad>: Abbrev Number: 11 (DW_TAG_array_type)
    <3ae>   DW_AT_type        : <0x15b>	
    <3b2>   DW_AT_sibling     : <0x3bd>	
 <2><3b6>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <3b7>   DW_AT_type        : <0x80>	
    <3bb>   DW_AT_upper_bound : 15	
 <1><3bd>: Abbrev Number: 11 (DW_TAG_array_type)
    <3be>   DW_AT_type        : <0xdf>	
    <3c2>   DW_AT_sibling     : <0x3cd>	
 <2><3c6>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <3c7>   DW_AT_type        : <0x80>	
    <3cb>   DW_AT_upper_bound : 15	
 <1><3cd>: Abbrev Number: 11 (DW_TAG_array_type)
    <3ce>   DW_AT_type        : <0x1d3>	
    <3d2>   DW_AT_sibling     : <0x3dd>	
 <2><3d6>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <3d7>   DW_AT_type        : <0x80>	
    <3db>   DW_AT_upper_bound : 4	
 <1><3dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <3de>   DW_AT_name        : TestStructArrayLevel5Type	
    <3f8>   DW_AT_decl_file   : 1	
    <3f9>   DW_AT_decl_line   : 59	
    <3fa>   DW_AT_type        : <0x2ff>	
 <1><3fe>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3ff>   DW_AT_name        : TestStructArrayLevel4	
    <415>   DW_AT_byte_size   : 160	
    <416>   DW_AT_decl_file   : 1	
    <417>   DW_AT_decl_line   : 61	
    <418>   DW_AT_sibling     : <0x439>	
 <2><41c>: Abbrev Number: 9 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x2d): level4_1	
    <421>   DW_AT_decl_file   : 1	
    <422>   DW_AT_decl_line   : 62	
    <423>   DW_AT_type        : <0x3dd>	
    <427>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><42a>: Abbrev Number: 9 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x36): level4_2	
    <42f>   DW_AT_decl_file   : 1	
    <430>   DW_AT_decl_line   : 63	
    <431>   DW_AT_type        : <0x3dd>	
    <435>   DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <1><439>: Abbrev Number: 3 (DW_TAG_typedef)
    <43a>   DW_AT_name        : TestStructArrayLevel4Type	
    <454>   DW_AT_decl_file   : 1	
    <455>   DW_AT_decl_line   : 64	
    <456>   DW_AT_type        : <0x3fe>	
 <1><45a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <45b>   DW_AT_byte_size   : 320	
    <45d>   DW_AT_decl_file   : 1	
    <45e>   DW_AT_decl_line   : 67	
    <45f>   DW_AT_sibling     : <0x481>	
 <2><463>: Abbrev Number: 9 (DW_TAG_member)
    <464>   DW_AT_name        : (indirect string, offset: 0x3f): levle3_1	
    <468>   DW_AT_decl_file   : 1	
    <469>   DW_AT_decl_line   : 68	
    <46a>   DW_AT_type        : <0x439>	
    <46e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><471>: Abbrev Number: 9 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x48): levle3_2	
    <476>   DW_AT_decl_file   : 1	
    <477>   DW_AT_decl_line   : 69	
    <478>   DW_AT_type        : <0x439>	
    <47c>   DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <1><481>: Abbrev Number: 3 (DW_TAG_typedef)
    <482>   DW_AT_name        : TestStructArrayLevel3Type	
    <49c>   DW_AT_decl_file   : 1	
    <49d>   DW_AT_decl_line   : 70	
    <49e>   DW_AT_type        : <0x45a>	
 <1><4a2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <4a3>   DW_AT_name        : TestStructArrayLevel2	
    <4b9>   DW_AT_byte_size   : 640	
    <4bb>   DW_AT_decl_file   : 1	
    <4bc>   DW_AT_decl_line   : 73	
    <4bd>   DW_AT_sibling     : <0x4df>	
 <2><4c1>: Abbrev Number: 9 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x6a): level2_1	
    <4c6>   DW_AT_decl_file   : 1	
    <4c7>   DW_AT_decl_line   : 74	
    <4c8>   DW_AT_type        : <0x481>	
    <4cc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><4cf>: Abbrev Number: 9 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x73): level2_2	
    <4d4>   DW_AT_decl_file   : 1	
    <4d5>   DW_AT_decl_line   : 75	
    <4d6>   DW_AT_type        : <0x481>	
    <4da>   DW_AT_data_member_location: 3 byte block: 23 c0 2 	(DW_OP_plus_uconst: 320)
 <1><4df>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e0>   DW_AT_name        : TestStructArrayLevel2Type	
    <4fa>   DW_AT_decl_file   : 1	
    <4fb>   DW_AT_decl_line   : 76	
    <4fc>   DW_AT_type        : <0x4a2>	
 <1><500>: Abbrev Number: 14 (DW_TAG_structure_type)
    <501>   DW_AT_name        : TestStructArrayLevel1	
    <517>   DW_AT_byte_size   : 1280	
    <519>   DW_AT_decl_file   : 1	
    <51a>   DW_AT_decl_line   : 79	
    <51b>   DW_AT_sibling     : <0x53d>	
 <2><51f>: Abbrev Number: 9 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0x0): level1_1	
    <524>   DW_AT_decl_file   : 1	
    <525>   DW_AT_decl_line   : 80	
    <526>   DW_AT_type        : <0x4df>	
    <52a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><52d>: Abbrev Number: 9 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x9): level1_2	
    <532>   DW_AT_decl_file   : 1	
    <533>   DW_AT_decl_line   : 81	
    <534>   DW_AT_type        : <0x4df>	
    <538>   DW_AT_data_member_location: 3 byte block: 23 80 5 	(DW_OP_plus_uconst: 640)
 <1><53d>: Abbrev Number: 3 (DW_TAG_typedef)
    <53e>   DW_AT_name        : TestStructArrayLevel1Type	
    <558>   DW_AT_decl_file   : 1	
    <559>   DW_AT_decl_line   : 82	
    <55a>   DW_AT_type        : <0x500>	
 <1><55e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <55f>   DW_AT_name        : TestStructLevel5	
    <570>   DW_AT_byte_size   : 8	
    <571>   DW_AT_decl_file   : 1	
    <572>   DW_AT_decl_line   : 85	
    <573>   DW_AT_sibling     : <0x5c7>	
 <2><577>: Abbrev Number: 9 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0x12): level5_1	
    <57c>   DW_AT_decl_file   : 1	
    <57d>   DW_AT_decl_line   : 86	
    <57e>   DW_AT_type        : <0xdf>	
    <582>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><585>: Abbrev Number: 9 (DW_TAG_member)
    <586>   DW_AT_name        : (indirect string, offset: 0x1b): level5_2	
    <58a>   DW_AT_decl_file   : 1	
    <58b>   DW_AT_decl_line   : 87	
    <58c>   DW_AT_type        : <0xdf>	
    <590>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><593>: Abbrev Number: 10 (DW_TAG_member)
    <594>   DW_AT_name        : levezl5_3	
    <59e>   DW_AT_decl_file   : 1	
    <59f>   DW_AT_decl_line   : 88	
    <5a0>   DW_AT_type        : <0xdf>	
    <5a4>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x24): level5_4	
    <5ac>   DW_AT_decl_file   : 1	
    <5ad>   DW_AT_decl_line   : 89	
    <5ae>   DW_AT_type        : <0xdf>	
    <5b2>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><5b5>: Abbrev Number: 10 (DW_TAG_member)
    <5b6>   DW_AT_name        : Filed2	
    <5bd>   DW_AT_decl_file   : 1	
    <5be>   DW_AT_decl_line   : 90	
    <5bf>   DW_AT_type        : <0x2e3>	
    <5c3>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><5c7>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c8>   DW_AT_name        : TestStructLevel5Type	
    <5dd>   DW_AT_decl_file   : 1	
    <5de>   DW_AT_decl_line   : 91	
    <5df>   DW_AT_type        : <0x55e>	
 <1><5e3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <5e4>   DW_AT_name        : TestStructLevel4	
    <5f5>   DW_AT_byte_size   : 16	
    <5f6>   DW_AT_decl_file   : 1	
    <5f7>   DW_AT_decl_line   : 93	
    <5f8>   DW_AT_sibling     : <0x619>	
 <2><5fc>: Abbrev Number: 9 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x2d): level4_1	
    <601>   DW_AT_decl_file   : 1	
    <602>   DW_AT_decl_line   : 94	
    <603>   DW_AT_type        : <0x5c7>	
    <607>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><60a>: Abbrev Number: 9 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x36): level4_2	
    <60f>   DW_AT_decl_file   : 1	
    <610>   DW_AT_decl_line   : 95	
    <611>   DW_AT_type        : <0x5c7>	
    <615>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><619>: Abbrev Number: 3 (DW_TAG_typedef)
    <61a>   DW_AT_name        : TestStructLevel4Type	
    <62f>   DW_AT_decl_file   : 1	
    <630>   DW_AT_decl_line   : 96	
    <631>   DW_AT_type        : <0x5e3>	
 <1><635>: Abbrev Number: 7 (DW_TAG_structure_type)
    <636>   DW_AT_name        : TestStructLevel3	
    <647>   DW_AT_byte_size   : 32	
    <648>   DW_AT_decl_file   : 1	
    <649>   DW_AT_decl_line   : 99	
    <64a>   DW_AT_sibling     : <0x66b>	
 <2><64e>: Abbrev Number: 9 (DW_TAG_member)
    <64f>   DW_AT_name        : (indirect string, offset: 0x3f): levle3_1	
    <653>   DW_AT_decl_file   : 1	
    <654>   DW_AT_decl_line   : 100	
    <655>   DW_AT_type        : <0x619>	
    <659>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><65c>: Abbrev Number: 9 (DW_TAG_member)
    <65d>   DW_AT_name        : (indirect string, offset: 0x48): levle3_2	
    <661>   DW_AT_decl_file   : 1	
    <662>   DW_AT_decl_line   : 101	
    <663>   DW_AT_type        : <0x619>	
    <667>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><66b>: Abbrev Number: 3 (DW_TAG_typedef)
    <66c>   DW_AT_name        : TestStructLevel3Type	
    <681>   DW_AT_decl_file   : 1	
    <682>   DW_AT_decl_line   : 102	
    <683>   DW_AT_type        : <0x635>	
 <1><687>: Abbrev Number: 7 (DW_TAG_structure_type)
    <688>   DW_AT_name        : TestStructLevel2	
    <699>   DW_AT_byte_size   : 64	
    <69a>   DW_AT_decl_file   : 1	
    <69b>   DW_AT_decl_line   : 105	
    <69c>   DW_AT_sibling     : <0x6bd>	
 <2><6a0>: Abbrev Number: 9 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x6a): level2_1	
    <6a5>   DW_AT_decl_file   : 1	
    <6a6>   DW_AT_decl_line   : 106	
    <6a7>   DW_AT_type        : <0x66b>	
    <6ab>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><6ae>: Abbrev Number: 9 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x73): level2_2	
    <6b3>   DW_AT_decl_file   : 1	
    <6b4>   DW_AT_decl_line   : 107	
    <6b5>   DW_AT_type        : <0x66b>	
    <6b9>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <1><6bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <6be>   DW_AT_name        : TestStructLevel2Type	
    <6d3>   DW_AT_decl_file   : 1	
    <6d4>   DW_AT_decl_line   : 108	
    <6d5>   DW_AT_type        : <0x687>	
 <1><6d9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <6da>   DW_AT_byte_size   : 128	
    <6db>   DW_AT_decl_file   : 1	
    <6dc>   DW_AT_decl_line   : 111	
    <6dd>   DW_AT_sibling     : <0x6fe>	
 <2><6e1>: Abbrev Number: 9 (DW_TAG_member)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x0): level1_1	
    <6e6>   DW_AT_decl_file   : 1	
    <6e7>   DW_AT_decl_line   : 112	
    <6e8>   DW_AT_type        : <0x6bd>	
    <6ec>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><6ef>: Abbrev Number: 9 (DW_TAG_member)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x9): level1_2	
    <6f4>   DW_AT_decl_file   : 1	
    <6f5>   DW_AT_decl_line   : 113	
    <6f6>   DW_AT_type        : <0x6bd>	
    <6fa>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <1><6fe>: Abbrev Number: 3 (DW_TAG_typedef)
    <6ff>   DW_AT_name        : TestStructLevel1Type	
    <714>   DW_AT_decl_file   : 1	
    <715>   DW_AT_decl_line   : 114	
    <716>   DW_AT_type        : <0x6d9>	
 <1><71a>: Abbrev Number: 16 (DW_TAG_union_type)
    <71b>   DW_AT_byte_size   : 64	
    <71c>   DW_AT_decl_file   : 1	
    <71d>   DW_AT_decl_line   : 126	
    <71e>   DW_AT_sibling     : <0x746>	
 <2><722>: Abbrev Number: 17 (DW_TAG_member)
    <723>   DW_AT_name        : union1	
    <72a>   DW_AT_decl_file   : 1	
    <72b>   DW_AT_decl_line   : 128	
    <72c>   DW_AT_type        : <0x13d>	
 <2><730>: Abbrev Number: 17 (DW_TAG_member)
    <731>   DW_AT_name        : unionStructl1	
    <73f>   DW_AT_decl_file   : 1	
    <740>   DW_AT_decl_line   : 129	
    <741>   DW_AT_type        : <0x6bd>	
 <1><746>: Abbrev Number: 7 (DW_TAG_structure_type)
    <747>   DW_AT_name        : TestUnionStructLevel1	
    <75d>   DW_AT_byte_size   : 128	
    <75e>   DW_AT_decl_file   : 1	
    <75f>   DW_AT_decl_line   : 123	
    <760>   DW_AT_sibling     : <0x77b>	
 <2><764>: Abbrev Number: 9 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x0): level1_1	
    <769>   DW_AT_decl_file   : 1	
    <76a>   DW_AT_decl_line   : 125	
    <76b>   DW_AT_type        : <0x6bd>	
    <76f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><772>: Abbrev Number: 18 (DW_TAG_member)
    <773>   DW_AT_type        : <0x71a>	
    <777>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <1><77b>: Abbrev Number: 3 (DW_TAG_typedef)
    <77c>   DW_AT_name        : TestUnionStructLevel1Type	
    <796>   DW_AT_decl_file   : 1	
    <797>   DW_AT_decl_line   : 132	
    <798>   DW_AT_type        : <0x746>	
 <1><79c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <79d>   DW_AT_name        : TestStruct5	
    <7a9>   DW_AT_byte_size   : 10000	
    <7ab>   DW_AT_decl_file   : 1	
    <7ac>   DW_AT_decl_line   : 152	
    <7ad>   DW_AT_sibling     : <0x855>	
 <2><7b1>: Abbrev Number: 10 (DW_TAG_member)
    <7b2>   DW_AT_name        : TestStruct5uint8	
    <7c3>   DW_AT_decl_file   : 1	
    <7c4>   DW_AT_decl_line   : 154	
    <7c5>   DW_AT_type        : <0x855>	
    <7c9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><7cc>: Abbrev Number: 10 (DW_TAG_member)
    <7cd>   DW_AT_name        : TestStruct5uint32	
    <7df>   DW_AT_decl_file   : 1	
    <7e0>   DW_AT_decl_line   : 155	
    <7e1>   DW_AT_type        : <0x865>	
    <7e5>   DW_AT_data_member_location: 3 byte block: 23 c8 1 	(DW_OP_plus_uconst: 200)
 <2><7e9>: Abbrev Number: 10 (DW_TAG_member)
    <7ea>   DW_AT_name        : TestStruct5float	
    <7fb>   DW_AT_decl_file   : 1	
    <7fc>   DW_AT_decl_line   : 156	
    <7fd>   DW_AT_type        : <0x875>	
    <801>   DW_AT_data_member_location: 3 byte block: 23 e8 2 	(DW_OP_plus_uconst: 360)
 <2><805>: Abbrev Number: 10 (DW_TAG_member)
    <806>   DW_AT_name        : TestUnionStructLevel1TypeMem	
    <823>   DW_AT_decl_file   : 1	
    <824>   DW_AT_decl_line   : 157	
    <825>   DW_AT_type        : <0x88e>	
    <829>   DW_AT_data_member_location: 3 byte block: 23 90 3 	(DW_OP_plus_uconst: 400)
 <2><82d>: Abbrev Number: 10 (DW_TAG_member)
    <82e>   DW_AT_name        : TestUnionArrayLevel1TypeMem	
    <84a>   DW_AT_decl_file   : 1	
    <84b>   DW_AT_decl_line   : 158	
    <84c>   DW_AT_type        : <0x89e>	
    <850>   DW_AT_data_member_location: 3 byte block: 23 90 8 	(DW_OP_plus_uconst: 1040)
 <1><855>: Abbrev Number: 11 (DW_TAG_array_type)
    <856>   DW_AT_type        : <0xdf>	
    <85a>   DW_AT_sibling     : <0x865>	
 <2><85e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <85f>   DW_AT_type        : <0x80>	
    <863>   DW_AT_upper_bound : 199	
 <1><865>: Abbrev Number: 11 (DW_TAG_array_type)
    <866>   DW_AT_type        : <0x13d>	
    <86a>   DW_AT_sibling     : <0x875>	
 <2><86e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <86f>   DW_AT_type        : <0x80>	
    <873>   DW_AT_upper_bound : 39	
 <1><875>: Abbrev Number: 11 (DW_TAG_array_type)
    <876>   DW_AT_type        : <0x885>	
    <87a>   DW_AT_sibling     : <0x885>	
 <2><87e>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <87f>   DW_AT_type        : <0x80>	
    <883>   DW_AT_upper_bound : 9	
 <1><885>: Abbrev Number: 2 (DW_TAG_base_type)
    <886>   DW_AT_byte_size   : 4	
    <887>   DW_AT_encoding    : 4	(float)
    <888>   DW_AT_name        : float	
 <1><88e>: Abbrev Number: 11 (DW_TAG_array_type)
    <88f>   DW_AT_type        : <0x77b>	
    <893>   DW_AT_sibling     : <0x89e>	
 <2><897>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <898>   DW_AT_type        : <0x80>	
    <89c>   DW_AT_upper_bound : 4	
 <1><89e>: Abbrev Number: 11 (DW_TAG_array_type)
    <89f>   DW_AT_type        : <0x53d>	
    <8a3>   DW_AT_sibling     : <0x8ae>	
 <2><8a7>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <8a8>   DW_AT_type        : <0x80>	
    <8ac>   DW_AT_upper_bound : 6	
 <1><8ae>: Abbrev Number: 3 (DW_TAG_typedef)
    <8af>   DW_AT_name        : Can_FrameType	
    <8bd>   DW_AT_decl_file   : 1	
    <8be>   DW_AT_decl_line   : 167	
    <8bf>   DW_AT_type        : <0xdf>	
 <1><8c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <8c4>   DW_AT_name        : Can_TxObjPriorityClassType	
    <8df>   DW_AT_decl_file   : 1	
    <8e0>   DW_AT_decl_line   : 170	
    <8e1>   DW_AT_type        : <0x13d>	
 <1><8e5>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e6>   DW_AT_name        : TestEnumATypeaaa	
    <8f7>   DW_AT_decl_file   : 1	
    <8f8>   DW_AT_decl_line   : 172	
    <8f9>   DW_AT_type        : <0x264>	
 <1><8fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <8fe>   DW_AT_name        : TestEnumATypeaaabbb	
    <912>   DW_AT_decl_file   : 1	
    <913>   DW_AT_decl_line   : 173	
    <914>   DW_AT_type        : <0x8e5>	
 <1><918>: Abbrev Number: 19 (DW_TAG_structure_type)
    <919>   DW_AT_name        : (indirect string, offset: 0x51): Can_TxHwObjectConfigType	
    <91d>   DW_AT_byte_size   : 8	
    <91e>   DW_AT_decl_file   : 1	
    <91f>   DW_AT_decl_line   : 179	
    <920>   DW_AT_sibling     : <0x982>	
 <2><924>: Abbrev Number: 10 (DW_TAG_member)
    <925>   DW_AT_name        : MsgObjId	
    <92e>   DW_AT_decl_file   : 1	
    <92f>   DW_AT_decl_line   : 182	
    <930>   DW_AT_type        : <0xdf>	
    <934>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><937>: Abbrev Number: 10 (DW_TAG_member)
    <938>   DW_AT_name        : HwControllerId	
    <947>   DW_AT_decl_file   : 1	
    <948>   DW_AT_decl_line   : 186	
    <949>   DW_AT_type        : <0xdf>	
    <94d>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><950>: Abbrev Number: 10 (DW_TAG_member)
    <951>   DW_AT_name        : FrameType	
    <95b>   DW_AT_decl_file   : 1	
    <95c>   DW_AT_decl_line   : 189	
    <95d>   DW_AT_type        : <0x8ae>	
    <961>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><964>: Abbrev Number: 10 (DW_TAG_member)
    <965>   DW_AT_name        : TxObjPriorityClass	
    <978>   DW_AT_decl_file   : 1	
    <979>   DW_AT_decl_line   : 192	
    <97a>   DW_AT_type        : <0x8c3>	
    <97e>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><982>: Abbrev Number: 20 (DW_TAG_typedef)
    <983>   DW_AT_name        : (indirect string, offset: 0x51): Can_TxHwObjectConfigType	
    <987>   DW_AT_decl_file   : 1	
    <988>   DW_AT_decl_line   : 194	
    <989>   DW_AT_type        : <0x918>	
 <1><98d>: Abbrev Number: 21 (DW_TAG_typedef)
    <98e>   DW_AT_name        : TestEnumType12	
    <99d>   DW_AT_decl_file   : 1	
    <99e>   DW_AT_decl_line   : 311	
    <9a0>   DW_AT_type        : <0x1d3>	
 <1><9a4>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9a5>   DW_AT_name        : _L9301_CHxDIAG_Bits	
    <9b9>   DW_AT_byte_size   : 1	
    <9ba>   DW_AT_decl_file   : 1	
    <9bb>   DW_AT_decl_line   : 317	
    <9bd>   DW_AT_sibling     : <0xa40>	
 <2><9c1>: Abbrev Number: 23 (DW_TAG_member)
    <9c2>   DW_AT_name        : ol	
    <9c5>   DW_AT_decl_file   : 1	
    <9c6>   DW_AT_decl_line   : 319	
    <9c8>   DW_AT_type        : <0xdf>	
    <9cc>   DW_AT_byte_size   : 1	
    <9cd>   DW_AT_bit_size    : 1	
    <9ce>   DW_AT_bit_offset  : 7	
    <9cf>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><9d2>: Abbrev Number: 23 (DW_TAG_member)
    <9d3>   DW_AT_name        : sp	
    <9d6>   DW_AT_decl_file   : 1	
    <9d7>   DW_AT_decl_line   : 320	
    <9d9>   DW_AT_type        : <0xdf>	
    <9dd>   DW_AT_byte_size   : 1	
    <9de>   DW_AT_bit_size    : 1	
    <9df>   DW_AT_bit_offset  : 6	
    <9e0>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><9e3>: Abbrev Number: 23 (DW_TAG_member)
    <9e4>   DW_AT_name        : sg	
    <9e7>   DW_AT_decl_file   : 1	
    <9e8>   DW_AT_decl_line   : 321	
    <9ea>   DW_AT_type        : <0xdf>	
    <9ee>   DW_AT_byte_size   : 1	
    <9ef>   DW_AT_bit_size    : 1	
    <9f0>   DW_AT_bit_offset  : 5	
    <9f1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><9f4>: Abbrev Number: 23 (DW_TAG_member)
    <9f5>   DW_AT_name        : oc	
    <9f8>   DW_AT_decl_file   : 1	
    <9f9>   DW_AT_decl_line   : 322	
    <9fb>   DW_AT_type        : <0xdf>	
    <9ff>   DW_AT_byte_size   : 1	
    <a00>   DW_AT_bit_size    : 1	
    <a01>   DW_AT_bit_offset  : 4	
    <a02>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a05>: Abbrev Number: 23 (DW_TAG_member)
    <a06>   DW_AT_name        : ot	
    <a09>   DW_AT_decl_file   : 1	
    <a0a>   DW_AT_decl_line   : 323	
    <a0c>   DW_AT_type        : <0xdf>	
    <a10>   DW_AT_byte_size   : 1	
    <a11>   DW_AT_bit_size    : 1	
    <a12>   DW_AT_bit_offset  : 3	
    <a13>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a16>: Abbrev Number: 23 (DW_TAG_member)
    <a17>   DW_AT_name        : uc_error	
    <a20>   DW_AT_decl_file   : 1	
    <a21>   DW_AT_decl_line   : 324	
    <a23>   DW_AT_type        : <0xdf>	
    <a27>   DW_AT_byte_size   : 1	
    <a28>   DW_AT_bit_size    : 1	
    <a29>   DW_AT_bit_offset  : 2	
    <a2a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><a2d>: Abbrev Number: 23 (DW_TAG_member)
    <a2e>   DW_AT_name        : res	
    <a32>   DW_AT_decl_file   : 1	
    <a33>   DW_AT_decl_line   : 325	
    <a35>   DW_AT_type        : <0xdf>	
    <a39>   DW_AT_byte_size   : 1	
    <a3a>   DW_AT_bit_size    : 2	
    <a3b>   DW_AT_bit_offset  : 0	
    <a3c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <1><a40>: Abbrev Number: 21 (DW_TAG_typedef)
    <a41>   DW_AT_name        : L9301_CHxDIAG_Bits	
    <a54>   DW_AT_decl_file   : 1	
    <a55>   DW_AT_decl_line   : 326	
    <a57>   DW_AT_type        : <0x9a4>	
 <1><a5b>: Abbrev Number: 24 (DW_TAG_union_type)
    <a5c>   DW_AT_byte_size   : 1	
    <a5d>   DW_AT_decl_file   : 1	
    <a5e>   DW_AT_decl_line   : 327	
    <a60>   DW_AT_sibling     : <0xa83>	
 <2><a64>: Abbrev Number: 25 (DW_TAG_member)
    <a65>   DW_AT_name        : U	
    <a67>   DW_AT_decl_file   : 1	
    <a68>   DW_AT_decl_line   : 329	
    <a6a>   DW_AT_type        : <0xdf>	
 <2><a6e>: Abbrev Number: 25 (DW_TAG_member)
    <a6f>   DW_AT_name        : I	
    <a71>   DW_AT_decl_file   : 1	
    <a72>   DW_AT_decl_line   : 330	
    <a74>   DW_AT_type        : <0xfd>	
 <2><a78>: Abbrev Number: 25 (DW_TAG_member)
    <a79>   DW_AT_name        : B	
    <a7b>   DW_AT_decl_file   : 1	
    <a7c>   DW_AT_decl_line   : 331	
    <a7e>   DW_AT_type        : <0xa40>	
 <1><a83>: Abbrev Number: 21 (DW_TAG_typedef)
    <a84>   DW_AT_name        : L9301_CHxDIAG_Type	
    <a97>   DW_AT_decl_file   : 1	
    <a98>   DW_AT_decl_line   : 332	
    <a9a>   DW_AT_type        : <0xa5b>	
 <1><a9e>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a9f>   DW_AT_external    : 1	
    <aa0>   DW_AT_name        : main	
    <aa5>   DW_AT_decl_file   : 1	
    <aa6>   DW_AT_decl_line   : 337	
    <aa8>   DW_AT_prototyped  : 1	
    <aa9>   DW_AT_type        : <0xc0>	
    <aad>   DW_AT_low_pc      : 0x800002cc	
    <ab1>   DW_AT_high_pc     : 0x80000408	
    <ab5>   DW_AT_frame_base  : 2 byte block: 8a 0 	(DW_OP_breg26: 0)
 <1><ab8>: Abbrev Number: 11 (DW_TAG_array_type)
    <ab9>   DW_AT_type        : <0x119>	
    <abd>   DW_AT_sibling     : <0xad4>	
 <2><ac1>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <ac2>   DW_AT_type        : <0x80>	
    <ac6>   DW_AT_upper_bound : 9	
 <2><ac7>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <ac8>   DW_AT_type        : <0x80>	
    <acc>   DW_AT_upper_bound : 19	
 <2><acd>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <ace>   DW_AT_type        : <0x80>	
    <ad2>   DW_AT_upper_bound : 29	
 <1><ad4>: Abbrev Number: 27 (DW_TAG_variable)
    <ad5>   DW_AT_name        : TestVarArrayUint163d	
    <aea>   DW_AT_decl_file   : 1	
    <aeb>   DW_AT_decl_line   : 150	
    <aec>   DW_AT_type        : <0xaf6>	
    <af0>   DW_AT_location    : 5 byte block: 3 0 a1 0 d0 	(DW_OP_addr: d000a100)
 <1><af6>: Abbrev Number: 28 (DW_TAG_volatile_type)
    <af7>   DW_AT_type        : <0xab8>	
 <1><afb>: Abbrev Number: 11 (DW_TAG_array_type)
    <afc>   DW_AT_type        : <0x982>	
    <b00>   DW_AT_sibling     : <0xb0b>	
 <2><b04>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b05>   DW_AT_type        : <0x80>	
    <b09>   DW_AT_upper_bound : 94	
 <1><b0b>: Abbrev Number: 27 (DW_TAG_variable)
    <b0c>   DW_AT_name        : Can_kTxHwObjectConfig_0	
    <b24>   DW_AT_decl_file   : 1	
    <b25>   DW_AT_decl_line   : 202	
    <b26>   DW_AT_type        : <0xb30>	
    <b2a>   DW_AT_location    : 5 byte block: 3 b8 4 0 80 	(DW_OP_addr: 800004b8)
 <1><b30>: Abbrev Number: 29 (DW_TAG_const_type)
    <b31>   DW_AT_type        : <0xb35>	
 <1><b35>: Abbrev Number: 28 (DW_TAG_volatile_type)
    <b36>   DW_AT_type        : <0xafb>	
 <1><b3a>: Abbrev Number: 30 (DW_TAG_variable)
    <b3b>   DW_AT_name        : TestStructVar1	
    <b4a>   DW_AT_decl_file   : 1	
    <b4b>   DW_AT_decl_line   : 118	
    <b4c>   DW_AT_type        : <0x6fe>	
    <b50>   DW_AT_external    : 1	
    <b51>   DW_AT_location    : 5 byte block: 3 cc 3b 1 d0 	(DW_OP_addr: d0013bcc)
 <1><b57>: Abbrev Number: 11 (DW_TAG_array_type)
    <b58>   DW_AT_type        : <0x6fe>	
    <b5c>   DW_AT_sibling     : <0xb67>	
 <2><b60>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b61>   DW_AT_type        : <0x80>	
    <b65>   DW_AT_upper_bound : 9	
 <1><b67>: Abbrev Number: 30 (DW_TAG_variable)
